Revit 2027 API
ShellLayerType Enumeration
 Used to distinguish exterior and interior shell layers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ShellLayerType
Public Enumeration ShellLayerType
public enum class ShellLayerType
type ShellLayerType
Members
Member name | Value | Description
Exterior | 1 |  Exterior shell layer.
Interior | 0 |  Interior shell layer.
Remarks
 Used as an argument to methods of CompoundStructure that deal with shell layers.
See Also
Reference
Autodesk.Revit.DB Namespace